Перем ПредыдущееЗначение;

#Область ОбработчикиСобытийФормы

Процедура ПриОткрытии()
	
	ЭлементыФормы.ТипДокумента1С.Заголовок = _ЛокКонтекст.СтруктураМетаданных.Документы1С[ТипДокумента1С].Синоним;
	ЭлементыФормы.ТипДокументаMS.Заголовок = _ЛокКонтекст.СтруктураМетаданных.ДокументыMS[ТипДокументаMS].Синоним;
	
	СписокРеквизитов1С = _ЛокКонтекст.СтруктураМетаданных.Документы1С[ТипДокумента1С].Реквизиты.Скопировать();		
	СписокРеквизитов1С.Добавить("Количество","Количество");
	
	ЭлементыФормы.ТаблицаРеквизитов.Колонки.НазваниеРеквизита.ЭлементУправления.СписокВыбора = СписокРеквизитов1С.Скопировать();
	
	Если ТаблицаРеквизитовИсходная.Количество() > 0 Тогда
		Для Каждого Строка Из ТаблицаРеквизитовИсходная Цикл
			НС = ТаблицаРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Строка);
		КонецЦикла;
	Иначе		
		СписокПредставленийРеквизитов1С = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокРеквизитовВПредставленииДокумента(ТипДокумента1С);	
		 			
		Для Каждого ПредставлениеРеквизита Из СписокПредставленийРеквизитов1С Цикл
			НС = ТаблицаРеквизитов.Добавить();
			НС.Использование = Истина;
			НС.ПредставлениеРеквизита = ПредставлениеРеквизита.Представление;
			НС.НазваниеРеквизита = ПредставлениеРеквизита.Значение;
			НС.ИспользоватьПриВыгрузке = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьВидимость();
	ОбновитьШаблон();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийОсновныеДействияФормы

Процедура ОсновныеДействияСохранитьИЗакрыть(Кнопка)
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаНастроек", 	ТаблицаРеквизитов.Скопировать());
	Результат.Вставить("ЗаменитьПредставлениеДокументаПриВыгрузке", ЗаменитьПредставлениеДокументаПриВыгрузке);
	Закрыть(Результат);
	
КонецПроцедуры

Процедура КомПанельТаблицыНастройкиПоУмолчанию(Кнопка)
	
	ТаблицаРеквизитов.Очистить();
	СписокПредставленийРеквизитов1С = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокРеквизитовВПредставленииДокумента(ТипДокумента1С);	
		 			
	Для Каждого ПредставлениеРеквизита Из СписокПредставленийРеквизитов1С Цикл
		НС = ТаблицаРеквизитов.Добавить();
		НС.Использование = Истина;
		НС.ПредставлениеРеквизита = ПредставлениеРеквизита.Представление;
		НС.НазваниеРеквизита = ПредставлениеРеквизита.Значение;
		НС.ИспользоватьПриВыгрузке = Ложь;
	КонецЦикла;

КонецПроцедуры

Процедура ТаблицаРеквизитовНазваниеРеквизитаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	ПредыдущееЗначение = ТекущаяСтрока.НазваниеРеквизита;
КонецПроцедуры

Процедура ТаблицаРеквизитовНазваниеРеквизитаПриИзменении(Элемент)
	
	Если ПредыдущееЗначение <> Элемент.Значение Тогда
		//НайденныйЭлементСписка = СписокРеквизитов1С.НайтиПоЗначению(Элемент.Значение);
		ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
		ТекущаяСтрока.ПредставлениеРеквизита = Элемент.Значение;
	КонецЕсли;	
		
КонецПроцедуры

Процедура ЗаменитьПредставлениеДокументаПриВыгрузкеПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

Процедура ОбновитьВидимость()
	ЭлементыФормы.ТаблицаРеквизитов.Колонки.ИспользоватьПриВыгрузке.Видимость = ЗаменитьПредставлениеДокументаПриВыгрузке;
	ЭлементыФормы.ШаблонИмени.Видимость =  ЗаменитьПредставлениеДокументаПриВыгрузке;
КонецПроцедуры

Процедура ТаблицаРеквизитовПриИзмененииФлажка(Элемент, Колонка)
	ОбновитьШаблон();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМеханизмы

Процедура ОбновитьШаблон()
	ЭлементыФормы.ШаблонИмени.Заголовок = "";
	
	Если ЗаменитьПредставлениеДокументаПриВыгрузке Тогда
		СтрокаИмени = "";
		ВключенныеРеквизиты = ТаблицаРеквизитов.НайтиСтроки(Новый Структура("ИспользоватьПриВыгрузке", Истина));
		Для Каждого Реквизит Из ВключенныеРеквизиты Цикл
			СтрокаИмени = СтрокаИмени+?(СтрокаИмени = "","",", ")+Реквизит.НазваниеРеквизита;
		КонецЦикла;
		ЭлементыФормы.ШаблонИмени.Заголовок  = СтрокаИмени;
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	ОбновитьШаблон();
КонецПроцедуры

#КонецОбласти