
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ВключенныеКолонки = ТаблицаКолонок.НайтиСтроки(Новый Структура("Использование",Истина));
	
	//Защита от дурака. Если выключили все галочки, то оставим хотя бы одну с названием документа
	Если ВключенныеКолонки.Количество() = 0 Тогда
		СтрокаНазвание  =  ТаблицаКолонок.НайтиСтроки(Новый Структура("Название","Ссылка"));
		СтрокаНазвание[0].Использование = Истина;
	КонецЕсли;
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ФормаОбменаВыбранныеКолонки", ТаблицаКолонок.Скопировать());	
	// обновим настройку в кэше
	ТекущиеНастройкиMS.ФормаОбменаВыбранныеКолонки =   ТаблицаКолонок.Скопировать();
	_ЛокКонтекст.ТекущиеНастройкиMS.ФормаОбменаВыбранныеКолонки =   ТаблицаКолонок.Скопировать();
	
	Закрыть(Истина);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ТаблицаКолонок.Очистить();
	
	СписокПредставленийПоУмолчанию = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокРеквизитовВПредставленииДокумента();
	
	СохраненныеНастройки = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ФормаОбменаВыбранныеКолонки");	

	Если СохраненныеНастройки <> Ложь И СохраненныеНастройки <> Неопределено Тогда
		Для Каждого Строка Из СохраненныеНастройки Цикл
			НС = ТаблицаКолонок.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Строка);
		КонецЦикла;
	Иначе		
		Для Каждого СписокПредставленийПоУмолчанию Из СписокПредставленийПоУмолчанию Цикл
			НС = ТаблицаКолонок.Добавить();
			НС.Использование 	= Ложь;
			НС.Представление 	= СписокПредставленийПоУмолчанию.Представление;
			НС.Название 			= СписокПредставленийПоУмолчанию.Значение;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьСписок();
	
КонецПроцедуры

Процедура ОбновитьСписок()
	
	// Пробежимся по всем БП и сделаем список всех настроенных колонок вывода
	ВсеРеквизитыНастроенныеВБП = Новый СписокЗначений;
	
	Для Каждого СтрокаБП Из _ЛокКонтекст.ТекущиеНастройкиMS.НастройкиБизнесПроцессов Цикл
		ТаблицаНастроекПредставлений = СтрокаБП.НастройкаПредставленийРеквизитовДокумента;
		Если  ТаблицаНастроекПредставлений.Количество() > 0 Тогда
			Для Каждого СтрокаНастройки Из ТаблицаНастроекПредставлений Цикл
				Если СтрокаНастройки.Использование = Истина 
					И ВсеРеквизитыНастроенныеВБП.НайтиПоЗначению(СтрокаНастройки.ПредставлениеРеквизита) = Неопределено Тогда
					ВсеРеквизитыНастроенныеВБП.Добавить(СтрокаНастройки.ПредставлениеРеквизита,СтрокаНастройки.ПредставлениеРеквизита);					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	
	// Проверим текущий список, если каких-то колонок нет в настройках, то удаляем из списка
	МассивСтрокКУдалению = Новый Массив;
	Для Каждого СтрокаНастройки Из ТаблицаКолонок Цикл
		Если СписокПредставленийПоУмолчанию.НайтиПоЗначению(СтрокаНастройки.Название)  = Неопределено
			И  ВсеРеквизитыНастроенныеВБП.НайтиПоЗначению(СтрокаНастройки.Название)  =  Неопределено Тогда
			МассивСтрокКУдалению.Добавить(СтрокаНастройки);
		КонецЕсли;
	КонецЦикла;
	Если МассивСтрокКУдалению.Количество() > 0 Тогда
		Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
			ТаблицаКолонок.Удалить(СтрокаКУдалению);
		КонецЦикла;
	КонецЕсли;
	
	// Добавим в таблицу реквизиты из БП, которых еще нет в списке
	КолонкиВСписке = ТаблицаКолонок.ВыгрузитьКолонку("Название");

	Для Каждого Настройка Из ВсеРеквизитыНастроенныеВБП Цикл
		Если КолонкиВСписке.Найти(Настройка.Значение) = Неопределено Тогда	
			НС = ТаблицаКолонок.Добавить();
			НС.Использование = Ложь;
			НС.Представление = Настройка.Представление;
			НС.Название 		 = Настройка.Значение;
			
			КолонкиВСписке.Добавить(Настройка.Значение);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

//Процедура ОбновитьСписок()
//	
//	КолонкиВСписке = ТаблицаКолонок.ВыгрузитьКолонку("Название");
//	
//	ВсеРеквизитыНастроенныеВБП = Новый СписокЗначений;
//	
//	Для Каждого СтрокаБП Из _ЛокКонтекст.ТекущиеНастройкиMS.НастройкиБизнесПроцессов Цикл
//		ТаблицаНастроекПредставлений = СтрокаБП.НастройкаПредставленийРеквизитовДокумента;
//		Если  ТаблицаНастроекПредставлений.Количество() > 0 Тогда
//			Для Каждого СтрокаНастройки Из ТаблицаНастроекПредставлений Цикл
//				Если КолонкиВСписке.Найти(СтрокаНастройки.ПредставлениеРеквизита) = Неопределено Тогда	
//					НС = ТаблицаКолонок.Добавить();
//					НС.Использование 	= Ложь;
//					НС.Представление 	= СтрокаНастройки.ПредставлениеРеквизита;
//					НС.Название 			= СтрокаНастройки.ПредставлениеРеквизита;
//					
//					КолонкиВСписке.Добавить(СтрокаНастройки.ПредставлениеРеквизита);
//				КонецЕсли;
//			КонецЦикла;
//		КонецЕсли;
//	КонецЦикла;	
//КонецПроцедуры

