
Процедура КоманднаяПанельГлавнаяСохранитьИЗакрыть(Кнопка)
	
	Если Не _ЛокКонтекст.КомЯдро_ПроверитьСоединениеССерверомSMARTS(, Ложь) Тогда
		Если _ЛокКонтекст.ЛокЯдро_ПредложитьПользователюСохранитьНастройкиВФайл() Тогда
			КоманднаяПанельГлавнаяСохранитьВФайл("");	
		КонецЕсли;		
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки();
	Закрыть();
КонецПроцедуры

Процедура КоманднаяПанельГлавнаяСохранить(Кнопка)
	
	Если Не _ЛокКонтекст.КомЯдро_ПроверитьСоединениеССерверомSMARTS(, Ложь) Тогда
		Если _ЛокКонтекст.ЛокЯдро_ПредложитьПользователюСохранитьНастройкиВФайл() Тогда
			КоманднаяПанельГлавнаяСохранитьВФайл("");	
		КонецЕсли;		
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки();
КонецПроцедуры

Процедура КоманднаяПанельГлавнаяСохранитьВФайл(Кнопка)
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ГлобальныеПараметры", ГлобальныеПараметры.Скопировать());
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкиВФайл(СтруктураНастройки, "ГлобальныеПараметры");
	
КонецПроцедуры

Процедура КоманднаяПанельГлавнаяВосстановитьИзФайла(Кнопка)
	
	СтруктураНастроек = _ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиИзФайла("ГлобальныеПараметры");
	
	Если СтруктураНастроек <> Неопределено Тогда
		_ЛокКонтекст.ЛокЯдро_ЗаполнитьФормуЗначениямиИзСтруктуры(ЭтаФорма, СтруктураНастроек);
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьНастройки()
	
	ТаблицаДляСохранения = ГлобальныеПараметры.Скопировать();
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ГлобальныеПараметры", ТаблицаДляСохранения);
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("ГлобальныеПараметры", ТаблицаДляСохранения);	
	
КонецПроцедуры

Процедура ГлобальныеПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ID_Параметра = _ЛокКонтекст.ЛокЯдро_ПолучитьНовыйID("NDS");
	КонецЕсли;
КонецПроцедуры


Процедура ПриОткрытии()
	ТаблицаПараметров = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ГлобальныеПараметры");
	// Если по данному ключу отсутствует настройка, то возвращается значение Ложь, поэтому используем проверку
	Если ТаблицаПараметров <> Ложь И ЗначениеЗаполнено(ТаблицаПараметров) Тогда
		Для Каждого СтрокаПараметра Из ТаблицаПараметров Цикл
			ЗаполнитьЗначенияСвойств(ГлобальныеПараметры.Добавить(), СтрокаПараметра);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

