Перем ПредыдущееЗначение;

#Область ОбработчикиСобытийФормы

Процедура ПриОткрытии()
	
	ЭлементыФормы.ТипДокумента1С.Заголовок = _ЛокКонтекст.СтруктураМетаданных.Документы1С[ТипДокумента1С].Синоним;
	ЭлементыФормы.ТипДокументаMS.Заголовок = _ЛокКонтекст.СтруктураМетаданных.ДокументыMS[ТипДокументаMS].Синоним;
	
	Если КлючНастройки = "Выгрузка_ШапкаДокумента" Тогда
		Заголовок = "Клеверенс: Настройка выгрузки полей шапки документа";
		СписокРеквизитов1С = _ЛокКонтекст.СтруктураМетаданных.Документы1С[ТипДокумента1С].Реквизиты.Скопировать();
		СписокРеквизитовMS = _ЛокКонтекст.СтруктураМетаданных.ДокументыMS[ТипДокументаMS].Реквизиты.Скопировать();
	Иначе
	    Заголовок = "Клеверенс: Настройка выгрузки полей табличной части документа";
		Если Найти(ИмяТабличнойЧасти1С, "Запрос") Тогда
			Если ЗначениеЗаполнено(ТекстЗапросаВыгрузкиНаТСД) Тогда
				СписокРеквизитов1С = ЗаполнитьСписокПолейЗапроса(ТипДокумента1С, ТекстЗапросаВыгрузкиНаТСД);			
			КонецЕсли;	
			СписокВычислимыхПолей.Очистить();
		Иначе
			СписокРеквизитов1С = _ЛокКонтекст.СтруктураМетаданных.Документы1С[ТипДокумента1С].ТабличныеЧасти[ИмяТабличнойЧасти1С].Реквизиты.Скопировать();
			СписокВычислимыхПолей = _ЛокКонтекст.ВычислимыеПоля.СписокПолей1С[ТипДокумента1С][ИмяТабличнойЧасти1С].Скопировать();
			ЭлементыФормы.ИмяТабличнойЧасти1С.Заголовок = _ЛокКонтекст.СтруктураМетаданных.Документы1С[ТипДокумента1С].ТабличныеЧасти[ИмяТабличнойЧасти1С].Синоним;
		КонецЕсли;
		
		Если 	ИмяТабличнойЧастиMS = "СтрокиПлан" 
			ИЛИ ИмяТабличнойЧастиMS = "СтрокиФакт" Тогда
			СписокРеквизитовMS = _ЛокКонтекст.СтруктураМетаданных.ДокументыMS[ТипДокументаMS].РеквизитыТЧ;							
			
		ИначеЕсли ИмяТабличнойЧастиMS = "СерииПлан" 
			ИЛИ   ИмяТабличнойЧастиMS = "СерииФакт" Тогда
			СписокРеквизитовMS = _ЛокКонтекст.СтруктураМетаданных.ДокументыMS[ТипДокументаMS].РеквизитыСерии;							
			
		ИначеЕсли ИмяТабличнойЧастиMS = "СерийныеНомераПлан" 
			ИЛИ   ИмяТабличнойЧастиMS = "СерийныеНомераФакт" Тогда
			СписокРеквизитовMS = _ЛокКонтекст.СтруктураМетаданных.ДокументыMS[ТипДокументаMS].РеквизитыСерийныеНомера;							
			
		Иначе
			СписокДопТаблиц = _ЛокКонтекст.СтруктураМетаданных.ДокументыMS[ТипДокументаMS].ДополнительныеТаблицы;
			Для Каждого ДопТаблица Из СписокДопТаблиц Цикл
				Если ДопТаблица.Представление = ИмяТабличнойЧастиMS Тогда
					СписокРеквизитовMS = ДопТаблица.Значение.Скопировать();
					Прервать;
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСписокПроизвольныхКодов();
	
	// Список Глобальных параметров
	ТаблицаГлобальныхПараметров = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаЗначениеТабличнойНастройкиSMARTS("ГлобальныеПараметры", Новый Структура("Использование", Истина));
	
	Если ТипЗнч(ТаблицаГлобальныхПараметров) = Тип("ТаблицаЗначений") Тогда  // ZHKN 13.09.2017
		Для Каждого СтрокаПараметра Из ТаблицаГлобальныхПараметров Цикл
		
			СписокГлобальныхПараметров.Добавить(СтрокаПараметра.ID_Параметра, СтрокаПараметра.Наименование);
		КонецЦикла;
	КонецЕсли;	
	
	// Список категорий приемника
	СписокТиповПриемника.Добавить("РеквизитMS", "Фиксированный реквизит Mobile SMARTS");
	СписокТиповПриемника.Добавить("НовыйРеквизит", "Новый реквизит Mobile SMARTS");
	
	// Список категорий источника
	СписокТиповИсточника.Добавить("Реквизит1С", "Реквизит 1С");
	Если КлючНастройки = "Выгрузка_ТабличнаяЧастьДокумента" И НЕ Найти(ИмяТабличнойЧасти1С, "Запрос") Тогда
		СписокТиповИсточника.Добавить("ВычислимоеПоле", "Вычислимое поле");
	КонецЕсли;
	СписокТиповИсточника.Добавить("ГлобальныйПараметр", "Глобальный параметр");	
	СписокТиповИсточника.Добавить("ПроизвольноеЗначение", "Произвольное значение");	
	СписокТиповИсточника.Добавить("ПроизвольныйКод", "Произвольный код");	
	
	// Список правил сопоставления для ссылочных типов
	СписокСпособовСопоставления.Добавить("СтрокаGUID",   "Ссылка (строка GUID)");
	СписокСпособовСопоставления.Добавить("Наименование", "Наименование (для справочников)");
	СписокСпособовСопоставления.Добавить("Код",          "Код (для справочников)");
	СписокСпособовСопоставления.Добавить("КакЕсть",      "Как есть (простой тип)");
	
	ЭлементыФормы.ТаблицаРеквизитов.Колонки.ТипПриемникаСиноним.ЭлементУправления.СписокВыбора = СписокТиповПриемника.Скопировать();
	ЭлементыФормы.ТаблицаРеквизитов.Колонки.ТипИсточникаСиноним.ЭлементУправления.СписокВыбора = СписокТиповИсточника.Скопировать();
	ЭлементыФормы.ТаблицаРеквизитов.Колонки.СинонимПриемника.ЭлементУправления.СписокВыбора = СписокРеквизитовMS.Скопировать();
	ЭлементыФормы.ТаблицаРеквизитов.Колонки.СпособСопоставленияСиноним.ЭлементУправления.СписокВыбора = СписокСпособовСопоставления.Скопировать();
	
	// Видимость и значения элементов
	ЭлементыФормы.НадписьТабличнаяЧасть1С.Видимость 	= КлючНастройки = "Выгрузка_ТабличнаяЧастьДокумента";
	ЭлементыФормы.ИмяТабличнойЧасти1С.Видимость     	= КлючНастройки = "Выгрузка_ТабличнаяЧастьДокумента";
	ЭлементыФормы.НадписьТекстЗапроса.Видимость     	= (Найти(ИмяТабличнойЧасти1С, "Запрос") > 0);
	ЭлементыФормы.РедактироватьТекстЗапроса.Видимость 	= (Найти(ИмяТабличнойЧасти1С, "Запрос") > 0);
	
	// Временное решение. В дальнейшем таблица должна передаваться напрямую
	Для Каждого СтрокаИсходнойТаблицы Из ТаблицаРеквизитовИсходная Цикл
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсходнойТаблицы);
		
		// Временное решение. Загрузка старых настроек
		Если ТаблицаРеквизитовИсходная.Колонки.Найти("ИмяMS") <> Неопределено Тогда
			НоваяСтрока.ИмяПриемника = СтрокаИсходнойТаблицы.ИмяMS;
			НайденныйЭлементИмениПриемника = СписокРеквизитовMS.НайтиПоЗначению(НоваяСтрока.ИмяПриемника);
			Если НайденныйЭлементИмениПриемника <> Неопределено Тогда
				НоваяСтрока.СинонимПриемника = НайденныйЭлементИмениПриемника.Представление;
			Иначе
				НоваяСтрока.СинонимПриемника = СтрокаИсходнойТаблицы.ИмяMS;
			КонецЕсли;
			НоваяСтрока.ТипПриемника = "РеквизитMS";
			НоваяСтрока.ТипПриемникаСиноним = "Фиксированный реквизит Mobile SMARTS";
		КонецЕсли;
		
		Если ТаблицаРеквизитовИсходная.Колонки.Найти("Имя1С") <> Неопределено Тогда
			
			Если СтрокаИсходнойТаблицы.Тип = "Реквизит 1С" Тогда
				// ищем в реквизитах
				НайденныйЭлементИмениИсточника = СписокРеквизитов1С.НайтиПоЗначению(СтрокаИсходнойТаблицы.Имя1С);
				Если НайденныйЭлементИмениИсточника <> Неопределено Тогда
					НоваяСтрока.ИмяИсточника = НайденныйЭлементИмениИсточника.Значение;
					НоваяСтрока.СинонимИсточника = НайденныйЭлементИмениИсточника.Представление;
					НоваяСтрока.ТипИсточника = "Реквизит1С";
					НоваяСтрока.ТипИсточникаСиноним = "Реквизит 1С";
				Иначе
					// ищем в вычислимых полях
					НайденныйЭлементИмениИсточника = СписокВычислимыхПолей.НайтиПоЗначению(СтрокаИсходнойТаблицы.Имя1С);
					Если НайденныйЭлементИмениИсточника <> Неопределено Тогда
						НоваяСтрока.ИмяИсточника = НайденныйЭлементИмениИсточника.Значение;
						НоваяСтрока.СинонимИсточника = НайденныйЭлементИмениИсточника.Представление;
						НоваяСтрока.ТипИсточника = "ВычислимоеПоле";
						НоваяСтрока.ТипИсточникаСиноним = "Вычислимое поле";
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НоваяСтрока.ИмяИсточника) Тогда
					Если ТаблицаРеквизитовИсходная.Колонки.Найти("ВыгружатьКакUID") <> Неопределено Тогда
						Если СтрокаИсходнойТаблицы.ВыгружатьКакUID = "Ссылка (GUID)" ИЛИ СтрокаИсходнойТаблицы.ВыгружатьКакUID = "Ссылка(GUID)" Тогда
							НоваяСтрока.СпособСопоставления = "СтрокаGUID";
							НоваяСтрока.СпособСопоставленияСиноним = "Ссылка (строка GUID)";
						ИначеЕсли СтрокаИсходнойТаблицы.ВыгружатьКакUID = "По наименованию" Тогда
							НоваяСтрока.СпособСопоставления = "Наименование";
							НоваяСтрока.СпособСопоставленияСиноним = "Наименование (для справочников)";
						ИначеЕсли СтрокаИсходнойТаблицы.ВыгружатьКакUID = "Код" Тогда
							НоваяСтрока.СпособСопоставления = "Код";
							НоваяСтрока.СпособСопоставленияСиноним = "Код (для справочников)";
						Иначе
							НоваяСтрока.СпособСопоставления = "КакЕсть";
							НоваяСтрока.СпособСопоставленияСиноним = "Как есть (простой тип)";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли СтрокаИсходнойТаблицы.Тип = "Дата" ИЛИ СтрокаИсходнойТаблицы.Тип = "Число" ИЛИ СтрокаИсходнойТаблицы.Тип = "Строка" ИЛИ СтрокаИсходнойТаблицы.Тип = "Булево" Тогда
				НоваяСтрока.ТипИсточника = "ПроизвольноеЗначение";
				НоваяСтрока.ТипИсточникаСиноним = "Произвольное значение";
				НоваяСтрока.СпособСопоставления = "КакЕсть";
				НоваяСтрока.СпособСопоставленияСиноним = "Как есть (простой тип)";
				НоваяСтрока.ЗначениеИсточника = СтрокаИсходнойТаблицы.Имя1С;
			КонецЕсли;
			
		КонецЕсли;
		
		// Временное решение Окончание
		
	КонецЦикла;
	ТаблицаРеквизитовИсходная.Очистить();
	// Временное решение. Окончание.
	
	УстановитьЦветаЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

Процедура РедактироватьТекстЗапросаНажатие(Элемент)
	
	ФормаРедактирования = ПолучитьФорму("ФормаСлужебная_РедактированиеТекстаЗапроса", ЭтаФорма, ЭтаФорма);
	ФормаРедактирования._ЛокКонтекст = _ЛокКонтекст;
	ФормаРедактирования.ТекстЗапроса = ТекстЗапросаВыгрузкиНаТСД;
	
	РезультатРедактирования = ФормаРедактирования.ОткрытьМодально();
	Если РезультатРедактирования <> Неопределено Тогда
		ТекстЗапросаВыгрузкиНаТСД = СокрЛП(РезультатРедактирования.ТекстЗапроса);
	КонецЕсли;		
	
	СписокРеквизитов1С = ЗаполнитьСписокПолейЗапроса(ТипДокумента1С, ТекстЗапросаВыгрузкиНаТСД);	
	
	УстановитьЦветаЭлементов();
	
КонецПроцедуры

Процедура ПараметрыЗапросаНажатие(Элемент)
	
	ФормаРедактирования = ПолучитьФорму("ФормаСлужебная_РедактированиеТекстаЗапроса", ЭтаФорма, ЭтаФорма);
	ФормаРедактирования._ЛокКонтекст = _ЛокКонтекст;
	ФормаРедактирования.ТекстЗапроса = ТекстКодаПолучениеПараметров;
	
	РезультатРедактирования = ФормаРедактирования.ОткрытьМодально();
	Если РезультатРедактирования <> Неопределено Тогда
		ТекстКодаПолучениеПараметров = СокрЛП(РезультатРедактирования.ТекстЗапроса);
	КонецЕсли;		
	
	СписокРеквизитов1С = ЗаполнитьСписокПолейЗапроса(ТипДокумента1С, ТекстЗапросаВыгрузкиНаТСД);	
	
	УстановитьЦветаЭлементов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийОсновныеДействияФормы

Процедура ОсновныеДействияСохранитьИЗакрыть(Кнопка)
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаНастроек", 			ТаблицаРеквизитов.Скопировать());
	Результат.Вставить("ТекстЗапросаВыгрузкиНаТСД", ТекстЗапросаВыгрузкиНаТСД);
	Результат.Вставить("ТекстКодаПолучениеПараметров", ТекстКодаПолучениеПараметров);

	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличногоПОля

Процедура ТаблицаРеквизитовПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Для Каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		
		ОформлениеСтроки.Ячейки.ИмяЗначениеПриемника.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.ИмяПриемника.Видимость = ОформлениеСтроки.ДанныеСтроки.ТипПриемника = "НовыйРеквизит";
		ОформлениеСтроки.Ячейки.СинонимПриемника.Видимость = НЕ ОформлениеСтроки.Ячейки.ИмяПриемника.Видимость;
		
		ОформлениеСтроки.Ячейки.ИмяЗначениеИсточника.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.ЗначениеИсточника.Видимость = ОформлениеСтроки.ДанныеСтроки.ТипИсточника = "ПроизвольноеЗначение";
		ОформлениеСтроки.Ячейки.СинонимИсточника.Видимость = НЕ ОформлениеСтроки.Ячейки.ЗначениеИсточника.Видимость;
		ОформлениеСтроки.Ячейки.СпособСопоставленияСиноним.ТолькоПросмотр = НЕ ОформлениеСтроки.ДанныеСтроки.ТипИсточника = "Реквизит1С";
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовТипПриемникаСинонимПриИзменении(Элемент)
	
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	НайденныйЭлементСписка = СписокТиповПриемника.НайтиПоЗначению(Элемент.Значение);
	
	ТекущаяСтрока.ТипПриемникаСиноним = НайденныйЭлементСписка.Представление;
	Если НайденныйЭлементСписка <> Неопределено И НайденныйЭлементСписка.Значение <> ПредыдущееЗначение Тогда
		ТекущаяСтрока.ТипПриемника = НайденныйЭлементСписка.Значение;
		ТекущаяСтрока.СинонимПриемника = "";
		ТекущаяСтрока.ИмяПриемника = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовТипПриемникаСинонимНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	ПредыдущееЗначение = ТекущаяСтрока.ТипПриемника;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовСинонимПриемникаПриИзменении(Элемент)
	
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	
	НайденныйЭлементСписка = Неопределено;
	Если ТекущаяСтрока.ТипПриемника = "РеквизитMS" Тогда
		НайденныйЭлементСписка = СписокРеквизитовMS.НайтиПоЗначению(Элемент.Значение);
	КонецЕсли;
	
	Если НайденныйЭлементСписка = Неопределено Тогда
		ТекущаяСтрока.ИмяПриемника = "";
	Иначе
		ТекущаяСтрока.СинонимПриемника = НайденныйЭлементСписка.Представление;
		ТекущаяСтрока.ИмяПриемника = НайденныйЭлементСписка.Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовСинонимПриемникаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	ПредыдущееЗначение = ТекущаяСтрока.ИмяИсточника;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовТипИсточникаСинонимПриИзменении(Элемент)
	
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	НайденныйЭлементСписка = СписокТиповИсточника.НайтиПоЗначению(Элемент.Значение);
	
	ТекущаяСтрока.ТипИсточникаСиноним = НайденныйЭлементСписка.Представление;
	Если НайденныйЭлементСписка <> Неопределено И НайденныйЭлементСписка.Значение <> ПредыдущееЗначение Тогда
		ТекущаяСтрока.ТипИсточника = НайденныйЭлементСписка.Значение;
		ТекущаяСтрока.СинонимИсточника = "";
		ТекущаяСтрока.ИмяИсточника = "";
		ТекущаяСтрока.ЗначениеИсточника = Неопределено;
	КонецЕсли;
	
	// Способ сопоставления
	Если ТекущаяСтрока.ТипИсточника = "Реквизит1С" Тогда
		ТекущаяСтрока.СпособСопоставления = "";
		ТекущаяСтрока.СпособСопоставленияСиноним = "";
	Иначе
		ТекущаяСтрока.СпособСопоставления = "КакЕсть";
		ТекущаяСтрока.СпособСопоставленияСиноним = "Как есть (простой тип)";
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовТипИсточникаСинонимНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	ПредыдущееЗначение = ТекущаяСтрока.ТипИсточника;
КонецПроцедуры

Процедура ТаблицаРеквизитовСинонимИсточникаПриИзменении(Элемент)
	
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	
	Если ТекущаяСтрока.ТипИсточника = "ПроизвольноеЗначение" Тогда
		ТекущаяСтрока.СинонимИсточника = "";
		ТекущаяСтрока.ИмяИсточника = "";
	Иначе	
		НайденныйЭлементСписка = Неопределено;
		Если ТекущаяСтрока.ТипИсточника = "Реквизит1С" Тогда
			НайденныйЭлементСписка = СписокРеквизитов1С.НайтиПоЗначению(Элемент.Значение);
		ИначеЕсли ТекущаяСтрока.ТипИсточника = "ВычислимоеПоле" Тогда
			НайденныйЭлементСписка = СписокВычислимыхПолей.НайтиПоЗначению(Элемент.Значение);
		ИначеЕсли ТекущаяСтрока.ТипИсточника = "ПроизвольныйКод" Тогда
			НайденныйЭлементСписка = СписокПроизвольныхКодов.НайтиПоЗначению(Элемент.Значение);
		ИначеЕсли ТекущаяСтрока.ТипИсточника = "ГлобальныйПараметр" Тогда
			НайденныйЭлементСписка = СписокГлобальныхПараметров.НайтиПоЗначению(Элемент.Значение);			
		КонецЕсли;
		Если НайденныйЭлементСписка <> Неопределено И НайденныйЭлементСписка.Значение = ПредыдущееЗначение Тогда
			ТекущаяСтрока.СинонимИсточника = НайденныйЭлементСписка.Представление;
		Иначе
			ТекущаяСтрока.СинонимИсточника = НайденныйЭлементСписка.Представление;
			ТекущаяСтрока.ИмяИсточника = НайденныйЭлементСписка.Значение;
			ТекущаяСтрока.ЗначениеИсточника = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовСинонимИсточникаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	
	Если ТекущаяСтрока.ТипИсточника = "ПроизвольныйКод" Тогда
		
		ПредыдущееЗначение = ТекущаяСтрока.ИмяИсточника;
		
		ФормаВыбора = ПолучитьФорму("ФормаСписка_ПроизвольныеКоды", ЭтаФорма, ЭтаФорма);
		ФормаВыбора._ЛокКонтекст = _ЛокКонтекст;
		ФормаВыбора.КлючНастройки = КлючНастройки;
		ФормаВыбора.ТипИсходногоДокумента1С = ТипДокумента1С;
		ФормаВыбора.ИмяТабличнойЧасти1С = ИмяТабличнойЧасти1С;
		Если КлючНастройки = "Выгрузка_ШапкаДокумента" Тогда
			ФормаВыбора.ПравилаОбменаШапка = ТаблицаРеквизитов.Скопировать();
			ФормаВыбора.ПравилаОбменаТабличнаяЧасть = ТаблицаРеквизитовДополнительная;
		ИначеЕсли КлючНастройки = "Выгрузка_ТабличнаяЧастьДокумента" Тогда
			ФормаВыбора.ПравилаОбменаШапка = ТаблицаРеквизитовДополнительная;
			ФормаВыбора.ПравилаОбменаТабличнаяЧасть = ТаблицаРеквизитов.Скопировать();
		КонецЕслИ;
		
		ВыбранноеЗначение = ФормаВыбора.ОткрытьМодально();
		ОбновитьСписокПроизвольныхКодов();
		
		Если ВыбранноеЗначение = Неопределено Тогда
			НайденныйЭлементСписка = СписокПроизвольныхКодов.НайтиПоЗначению(ПредыдущееЗначение);
		Иначе 
			НайденныйЭлементСписка = СписокПроизвольныхКодов.НайтиПоЗначению(ВыбранноеЗначение);
		КонецЕсли;
		
		Если НайденныйЭлементСписка = Неопределено Тогда
			ТекущаяСтрока.ИмяИсточника = "";
			ТекущаяСтрока.СинонимИсточника = "";
		Иначе
			ТекущаяСтрока.ИмяИсточника = НайденныйЭлементСписка.Значение;
			ТекущаяСтрока.СинонимИсточника = НайденныйЭлементСписка.Представление;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовСинонимИсточникаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();	
	
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	ПредыдущееЗначение = ТекущаяСтрока.ИмяИсточника;
	
	Если ТекущаяСтрока.ТипИсточника = "Реквизит1С" Тогда
		Элемент.СписокВыбора = СписокРеквизитов1С.Скопировать();
	ИначеЕсли ТекущаяСтрока.ТипИсточника = "ПроизвольныйКод" Тогда
		Элемент.СписокВыбора = СписокПроизвольныхКодов.Скопировать();
	ИначеЕсли ТекущаяСтрока.ТипИсточника = "ВычислимоеПоле" Тогда
		Элемент.СписокВыбора = СписокВычислимыхПолей.Скопировать();
	ИначеЕсли ТекущаяСтрока.ТипИсточника = "ГлобальныйПараметр" Тогда
		Элемент.СписокВыбора = СписокГлобальныхПараметров.Скопировать();		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаРеквизитовСпособСопоставленияСинонимПриИзменении(Элемент)
	
	ТекущаяСтрока = ЭлементыФормы.ТаблицаРеквизитов.ТекущиеДанные;
	НайденныйЭлементСписка = СписокСпособовСопоставления.НайтиПоЗначению(Элемент.Значение);
	
	ТекущаяСтрока.СпособСопоставления = НайденныйЭлементСписка.Значение;
	ТекущаяСтрока.СпособСопоставленияСиноним = НайденныйЭлементСписка.Представление;
	
КонецПроцедуры

Процедура КомПанельТаблицыУдалитьВсеНастройки(Кнопка)
	ТаблицаРеквизитов.Очистить();
КонецПроцедуры

Процедура КомПанельТаблицыЗагрузитьНастройкиПоУмолчанию(Кнопка)
	
	ЗагрузитьНастройкиПоУмолчанию();	
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМеханизмы

Процедура ОбновитьСписокПроизвольныхКодов()
	
	СписокПроизвольныхКодов.Очистить();
	
	ТаблицаПроизвольныхКодов = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ПроизвольныеКоды_" + КлючНастройки);
	Если ТаблицаПроизвольныхКодов <> Ложь И ТипЗнч(ТаблицаПроизвольныхКодов) = Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаТЗ Из ТаблицаПроизвольныхКодов Цикл
			СписокПроизвольныхКодов.Добавить(СтрокаТЗ.ID_ПроизвольногоКода, СтрокаТЗ.Наименование);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьСписокПолейЗапроса(ТипДокумента1С, ТекстЗапроса);
	
	СписокПолей = Новый СписокЗначений;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документы[ТипДокумента1С].ПустаяСсылка());
	
	ПараметрыЗапроса = Новый Структура;
	Попытка
		Выполнить(СтрЗаменить(ТекстКодаПолучениеПараметров, "ДокументДляВыгрузки", "Документы[ТипДокумента1С].ПустаяСсылка()"));
		
		Если ПараметрыЗапроса.Количество() Тогда
			Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
				Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);	
			КонецЦикла;
		КонецЕсли;
	Исключение
		Сообщить("Ошибка получения параметров запроса табличной части." + Символы.ПС + ОписаниеОшибки());
		Возврат СписокПолей;
	КонецПопытки;	
	
	
	Попытка
		Результат = Запрос.Выполнить().Выгрузить();
		Для Каждого Колонка из Результат.Колонки Цикл
			СписокПолей.Добавить(Колонка.Имя, Колонка.Имя);
		КонецЦикла;
	Исключение
		//Попытка
		//	Если ТипДокумента1С = "ТТНВходящаяЕГАИС" тогда
		//		АкцизныеМарки = Новый ТаблицаЗначений;
		//		АкцизныеМарки.Колонки.Добавить("Справка2",          Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
		//		АкцизныеМарки.Колонки.Добавить("ЗначениеШтрихкода", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(200)));
		//		Запрос.УстановитьПараметр("АкцизныеМарки", АкцизныеМарки);
		//		Результат = Запрос.Выполнить().Выгрузить();
		//		Для Каждого Колонка из Результат.Колонки Цикл
		//			СписокПолей.Добавить(Колонка.Имя, Колонка.Имя);
		//		КонецЦикла;
		//	КонецЕсли;	
		//Исключение
		//КонецПопытки;
		
		Сообщить("Не удалось получить список полей по причине ошибки выполнения запроса.
		|"+ОписаниеОшибки());

	КонецПопытки;
	
	Возврат СписокПолей;

КонецФункции

Процедура ЗагрузитьНастройкиПоУмолчанию()

	Если ТаблицаРеквизитов.Количество() Тогда
		
		Ответ = Вопрос("Текущие настройки будут утеряны! Перезаписать их?", РежимДиалогаВопрос.ДаНет, , , "Внимание");
	
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ТаблицаРеквизитов.Очистить();
		Иначе
			Возврат;
		КонецЕсли;					
		
	КонецЕсли;	
	 
	Если КлючНастройки = "Выгрузка_ШапкаДокумента" Тогда // заполнить реквизиты шапки									
				
		// ************************** Ссылка -> Ид ***************************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("Ссылка") <> Неопределено
			И СписокРеквизитовMS.НайтиПоЗначению("Ид") <> Неопределено Тогда
		
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "Ид";
			НоваяСтрока.СинонимПриемника 			= "Ид";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "Реквизит1С";
			НоваяСтрока.ТипИсточникаСиноним			= "Реквизит 1С";
			НоваяСтрока.ИмяИсточника 				= "Ссылка";
			НоваяСтрока.СинонимИсточника 			= "Ссылка";		
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= "";		
			
			НоваяСтрока.СпособСопоставления			= "СтрокаGUID";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Ссылка (строка GUID)";
			
			НоваяСтрока.Комментарий 				= "";		
		
		КонецЕсли;
								
		// ************************** 1 -> ИдСклада ***************************************
		
		Если СписокРеквизитовMS.НайтиПоЗначению("ИдСклада") <> Неопределено Тогда
			
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "ИдСклада";
			НоваяСтрока.СинонимПриемника 			= "ИдСклада";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "ПроизвольноеЗначение";
			НоваяСтрока.ТипИсточникаСиноним			= "Произвольное значение";
			НоваяСтрока.ИмяИсточника 				= "";
			НоваяСтрока.СинонимИсточника 			= "";		
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= "1";		
			
			НоваяСтрока.СпособСопоставления			= "КакЕсть";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
			
			НоваяСтрока.Комментарий 				= "";			
			
		КонецЕсли;
		
		// ************************** Истина -> ВыдаватьПоШтрихкоду ***************************************
		
		Если СписокРеквизитовMS.НайтиПоЗначению("ВыдаватьПоШтрихкоду") <> Неопределено Тогда
			
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "ВыдаватьПоШтрихкоду";
			НоваяСтрока.СинонимПриемника 			= "ВыдаватьПоШтрихкоду";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "ПроизвольноеЗначение";
			НоваяСтрока.ТипИсточникаСиноним			= "Произвольное значение";
			НоваяСтрока.ИмяИсточника 				= "";
			НоваяСтрока.СинонимИсточника 			= "";		
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= Истина;		
			
			НоваяСтрока.СпособСопоставления			= "КакЕсть";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
			
			НоваяСтрока.Комментарий 				= "";					
			
		КонецЕсли;
		
		// ************************** Контрагент -> ИдКонтрагента ***************************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("Контрагент") <> Неопределено
			И СписокРеквизитовMS.НайтиПоЗначению("ИдКонтрагента") <> Неопределено Тогда
			
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "ИдКонтрагента";
			НоваяСтрока.СинонимПриемника 			= "ИдКонтрагента";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "Реквизит1С";
			НоваяСтрока.ТипИсточникаСиноним			= "Реквизит 1С";
			НоваяСтрока.ИмяИсточника 				= "Контрагент";
			НоваяСтрока.СинонимИсточника 			= "Контрагент";		
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= "";		
			
			НоваяСтрока.СпособСопоставления			= "СтрокаGUID";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Ссылка (строка GUID)";
			
			НоваяСтрока.Комментарий 				= "";							
			
		КонецЕсли;
		
		// ************************** Склад -> ИдСклада1С ***************************************
		
		Если (СписокРеквизитов1С.НайтиПоЗначению("Склад") <> Неопределено ИЛИ СписокРеквизитов1С.НайтиПоЗначению("СкладОрдер") <> Неопределено)
			И СписокРеквизитовMS.НайтиПоЗначению("ИдСклада1С") <> Неопределено Тогда		
		
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "ИдСклада1С";
			НоваяСтрока.СинонимПриемника 			= "ИдСклада1С";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "Реквизит1С";
			НоваяСтрока.ТипИсточникаСиноним			= "Реквизит 1С";
			
			Если СписокРеквизитов1С.НайтиПоЗначению("Склад") <> Неопределено Тогда		
				НоваяСтрока.ИмяИсточника 			= "Склад";
				НоваяСтрока.СинонимИсточника 		= "Склад";		
			ИначеЕсли СписокРеквизитов1С.НайтиПоЗначению("СкладОрдер") <> Неопределено Тогда
				НоваяСтрока.ИмяИсточника 			= "СкладОрдер";
				НоваяСтрока.СинонимИсточника 		= "Склад-ордер";		
			КонецЕсли;	
			
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= "";		
			
			НоваяСтрока.СпособСопоставления			= "СтрокаGUID";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Ссылка (строка GUID)";
			
			НоваяСтрока.Комментарий 				= "";		
		
		КонецЕсли;
		
		// ************************** СкладОтправитель -> ИдСклада1СОткуда ***************************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("СкладОтправитель") <> Неопределено
			И СписокРеквизитовMS.НайтиПоЗначению("ИдСклада1СОткуда") <> Неопределено Тогда		
		
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "ИдСклада1СОткуда";
			НоваяСтрока.СинонимПриемника 			= "ИдСклада1СОткуда";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "Реквизит1С";
			НоваяСтрока.ТипИсточникаСиноним			= "Реквизит 1С";		
			НоваяСтрока.ИмяИсточника 				= "СкладОтправитель";
			НоваяСтрока.СинонимИсточника 			= "Склад отправитель";			
			
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= "";		
			
			НоваяСтрока.СпособСопоставления			= "СтрокаGUID";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Ссылка (строка GUID)";
			
			НоваяСтрока.Комментарий 				= "";		
		
		КонецЕсли;		
		
		// ************************** СкладПолучатель -> ИдСклада1СКуда ***************************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("СкладПолучатель") <> Неопределено
			И СписокРеквизитовMS.НайтиПоЗначению("ИдСклада1СКуда") <> Неопределено Тогда		
		
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "ИдСклада1СКуда";
			НоваяСтрока.СинонимПриемника 			= "ИдСклада1СКуда";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "Реквизит1С";
			НоваяСтрока.ТипИсточникаСиноним			= "Реквизит 1С";		
			НоваяСтрока.ИмяИсточника 				= "СкладПолучатель";
			НоваяСтрока.СинонимИсточника 			= "Склад получатель";			
			
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= "";		
			
			НоваяСтрока.СпособСопоставления			= "СтрокаGUID";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Ссылка (строка GUID)";
			
			НоваяСтрока.Комментарий 				= "";		
		
		КонецЕсли;
		
	ИначеЕсли КлючНастройки = "Выгрузка_ТабличнаяЧастьДокумента" Тогда // заполнить реквизиты ТЧ
		
		// ************************** Номенклатура -> ИдТовара ***************************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("Номенклатура") <> Неопределено
			И СписокРеквизитовMS.НайтиПоЗначению("ИдТовара") <> Неопределено Тогда
		
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "ИдТовара";
			НоваяСтрока.СинонимПриемника 			= "ИдТовара";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "ВычислимоеПоле";
			НоваяСтрока.ТипИсточникаСиноним			= "Вычислимое поле";
			НоваяСтрока.ИмяИсточника 				= "ИдТовара";
			НоваяСтрока.СинонимИсточника 			= "Идентификатор Номенклатуры";		
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= "";		
			
			НоваяСтрока.СпособСопоставления			= "КакЕсть";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
			
			НоваяСтрока.Комментарий 				= "";		
		
		КонецЕсли;				
		
		// ********************* ЕдиницаИзмерения -> ИдУпаковки, ИдЕдиницыИзмерения **************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("ЕдиницаИзмерения") <> Неопределено Тогда						
			
			Если СписокРеквизитовMS.НайтиПоЗначению("ИдУпаковки") <> Неопределено Тогда
				
				НоваяСтрока = ТаблицаРеквизитов.Добавить();
				
				НоваяСтрока.Выгружать 					= Истина;
				
				НоваяСтрока.ТипПриемника				= "РеквизитMS";		
				НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
				НоваяСтрока.ИмяПриемника 				= "ИдУпаковки";
				НоваяСтрока.СинонимПриемника 			= "ИдУпаковки";
				НоваяСтрока.ИмяЗначениеПриемника 		= "";
				
				НоваяСтрока.ТипИсточника 				= "ВычислимоеПоле";
				НоваяСтрока.ТипИсточникаСиноним			= "Вычислимое поле";
				НоваяСтрока.ИмяИсточника 				= "ИдУпаковки";
				НоваяСтрока.СинонимИсточника 			= "Наименование Единицы измерения";		
				НоваяСтрока.ИмяЗначениеИсточника 		= "";		
				НоваяСтрока.ЗначениеИсточника			= "";		
				
				НоваяСтрока.СпособСопоставления			= "КакЕсть";		
				НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
				
				НоваяСтрока.Комментарий 				= "";		
				
			КонецЕсли;			
			
			Если СписокРеквизитовMS.НайтиПоЗначению("ИдЕдиницыИзмерения") <> Неопределено Тогда
				
				НоваяСтрока = ТаблицаРеквизитов.Добавить();
				
				НоваяСтрока.Выгружать 					= Истина;
				
				НоваяСтрока.ТипПриемника				= "РеквизитMS";		
				НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
				НоваяСтрока.ИмяПриемника 				= "ИдЕдиницыИзмерения";
				НоваяСтрока.СинонимПриемника 			= "ИдЕдиницыИзмерения";
				НоваяСтрока.ИмяЗначениеПриемника 		= "";
				
				НоваяСтрока.ТипИсточника 				= "ВычислимоеПоле";
				НоваяСтрока.ТипИсточникаСиноним			= "Вычислимое поле";
				НоваяСтрока.ИмяИсточника 				= "ИдЕдиницыИзмерения";
				НоваяСтрока.СинонимИсточника 			= "Идентификатор Единицы измерения";		
				НоваяСтрока.ИмяЗначениеИсточника 		= "";		
				НоваяСтрока.ЗначениеИсточника			= "";		
				
				НоваяСтрока.СпособСопоставления			= "КакЕсть";		
				НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
				
				НоваяСтрока.Комментарий 				= "";		
				
			КонецЕсли;			
			
		КонецЕсли;		
		
		// ********************* Характеристика -> ИдХарактеристики, ИмяХарактеристики **************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("ХарактеристикаНоменклатуры") <> Неопределено Тогда						
			
			Если СписокРеквизитовMS.НайтиПоЗначению("ИдХарактеристики") <> Неопределено Тогда
				
				НоваяСтрока = ТаблицаРеквизитов.Добавить();
				
				НоваяСтрока.Выгружать 					= Истина;
				
				НоваяСтрока.ТипПриемника				= "РеквизитMS";		
				НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
				НоваяСтрока.ИмяПриемника 				= "ИдХарактеристики";
				НоваяСтрока.СинонимПриемника 			= "ИдХарактеристики";
				НоваяСтрока.ИмяЗначениеПриемника 		= "";
				
				НоваяСтрока.ТипИсточника 				= "ВычислимоеПоле";
				НоваяСтрока.ТипИсточникаСиноним			= "Вычислимое поле";
				НоваяСтрока.ИмяИсточника 				= "ИдХарактеристики";
				НоваяСтрока.СинонимИсточника 			= "Идентификатор Характеристики";		
				НоваяСтрока.ИмяЗначениеИсточника 		= "";		
				НоваяСтрока.ЗначениеИсточника			= "";		
				
				НоваяСтрока.СпособСопоставления			= "КакЕсть";		
				НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
				
				НоваяСтрока.Комментарий 				= "";		
				
			КонецЕсли;			
			
			Если СписокРеквизитовMS.НайтиПоЗначению("ИмяХарактеристики") <> Неопределено Тогда
				
				НоваяСтрока = ТаблицаРеквизитов.Добавить();
				
				НоваяСтрока.Выгружать 					= Истина;
				
				НоваяСтрока.ТипПриемника				= "РеквизитMS";		
				НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
				НоваяСтрока.ИмяПриемника 				= "ИмяХарактеристики";
				НоваяСтрока.СинонимПриемника 			= "ИмяХарактеристики";
				НоваяСтрока.ИмяЗначениеПриемника 		= "";
				
				НоваяСтрока.ТипИсточника 				= "ВычислимоеПоле";
				НоваяСтрока.ТипИсточникаСиноним			= "Вычислимое поле";
				НоваяСтрока.ИмяИсточника 				= "ИмяХарактеристики";
				НоваяСтрока.СинонимИсточника 			= "Наименование Характеристики";		
				НоваяСтрока.ИмяЗначениеИсточника 		= "";		
				НоваяСтрока.ЗначениеИсточника			= "";		
				
				НоваяСтрока.СпособСопоставления			= "КакЕсть";		
				НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
				
				НоваяСтрока.Комментарий 				= "";		
				
			КонецЕсли;			
			
		КонецЕсли;		
		
		// ********************* СерияНоменклатуры -> ИдСерии, ИмяСерии ****************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("СерияНоменклатуры") <> Неопределено Тогда						
			
			Если СписокРеквизитовMS.НайтиПоЗначению("ИдСерии") <> Неопределено Тогда
				
				НоваяСтрока = ТаблицаРеквизитов.Добавить();
				
				НоваяСтрока.Выгружать 					= Истина;
				
				НоваяСтрока.ТипПриемника				= "РеквизитMS";		
				НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
				НоваяСтрока.ИмяПриемника 				= "ИдСерии";
				НоваяСтрока.СинонимПриемника 			= "ИдСерии";
				НоваяСтрока.ИмяЗначениеПриемника 		= "";
				
				НоваяСтрока.ТипИсточника 				= "ВычислимоеПоле";
				НоваяСтрока.ТипИсточникаСиноним			= "Вычислимое поле";
				НоваяСтрока.ИмяИсточника 				= "ИдСерии";
				НоваяСтрока.СинонимИсточника 			= "Идентификатор Серии";		
				НоваяСтрока.ИмяЗначениеИсточника 		= "";		
				НоваяСтрока.ЗначениеИсточника			= "";		
				
				НоваяСтрока.СпособСопоставления			= "КакЕсть";		
				НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
				
				НоваяСтрока.Комментарий 				= "";		
				
			КонецЕсли;			
			
			Если СписокРеквизитовMS.НайтиПоЗначению("ИмяСерии") <> Неопределено Тогда
				
				НоваяСтрока = ТаблицаРеквизитов.Добавить();
				
				НоваяСтрока.Выгружать 					= Истина;
				
				НоваяСтрока.ТипПриемника				= "РеквизитMS";		
				НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
				НоваяСтрока.ИмяПриемника 				= "ИмяСерии";
				НоваяСтрока.СинонимПриемника 			= "ИмяСерии";
				НоваяСтрока.ИмяЗначениеПриемника 		= "";
				
				НоваяСтрока.ТипИсточника 				= "ВычислимоеПоле";
				НоваяСтрока.ТипИсточникаСиноним			= "Вычислимое поле";
				НоваяСтрока.ИмяИсточника 				= "ИмяСерии";
				НоваяСтрока.СинонимИсточника 			= "Наименование Серии";		
				НоваяСтрока.ИмяЗначениеИсточника 		= "";		
				НоваяСтрока.ЗначениеИсточника			= "";		
				
				НоваяСтрока.СпособСопоставления			= "КакЕсть";		
				НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
				
				НоваяСтрока.Комментарий 				= "";		
				
			КонецЕсли;			
			
		КонецЕсли;		
		
		// ************************** Количество -> КоличествоПлан ***************************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("Количество") <> Неопределено
			И СписокРеквизитовMS.НайтиПоЗначению("КоличествоПлан") <> Неопределено Тогда
		
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "КоличествоПлан";
			НоваяСтрока.СинонимПриемника 			= "КоличествоПлан";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "Реквизит1С";
			НоваяСтрока.ТипИсточникаСиноним			= "Реквизит 1С";
			НоваяСтрока.ИмяИсточника 				= "Количество";
			НоваяСтрока.СинонимИсточника 			= "Количество";		
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= "";		
			
			НоваяСтрока.СпособСопоставления			= "КакЕсть";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
			
			НоваяСтрока.Комментарий 				= "";		
		
		КонецЕсли;		
		
		// ************************** Цена -> Цена ***************************************
		
		Если СписокРеквизитов1С.НайтиПоЗначению("Цена") <> Неопределено
			И СписокРеквизитовMS.НайтиПоЗначению("Цена") <> Неопределено Тогда
		
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			
			НоваяСтрока.Выгружать 					= Истина;
			
			НоваяСтрока.ТипПриемника				= "РеквизитMS";		
			НоваяСтрока.ТипПриемникаСиноним 		= "Фиксированный реквизит Mobile SMARTS";				
			НоваяСтрока.ИмяПриемника 				= "Цена";
			НоваяСтрока.СинонимПриемника 			= "Цена";
			НоваяСтрока.ИмяЗначениеПриемника 		= "";
			
			НоваяСтрока.ТипИсточника 				= "Реквизит1С";
			НоваяСтрока.ТипИсточникаСиноним			= "Реквизит 1С";
			НоваяСтрока.ИмяИсточника 				= "Цена";
			НоваяСтрока.СинонимИсточника 			= "Цена";		
			НоваяСтрока.ИмяЗначениеИсточника 		= "";		
			НоваяСтрока.ЗначениеИсточника			= "";		
			
			НоваяСтрока.СпособСопоставления			= "КакЕсть";		
			НоваяСтрока.СпособСопоставленияСиноним 	= "Как есть (простой тип)";
			
			НоваяСтрока.Комментарий 				= "";		
		
		КонецЕсли;		
		
	КонецЕсли;	

КонецПроцедуры

Процедура УстановитьЦветаЭлементов()
	
	ЭлементыФормы.РедактироватьТекстЗапроса.ЦветТекста = ?(СтрДлина(СокрЛП(ТекстЗапросаВыгрузкиНаТСД)), WebЦвета.Зеленый, WebЦвета.Красный);
	
КонецПроцедуры	

#КонецОбласти